{
  "backend/main.mo": "Main canister logic handling user profiles, orders, and subscriptions with access control and migration integration.",
  "backend/migration.mo": "Defines a no-op migration function returning the state unchanged.",
  "feature_evidence.json": "Lists feature evidence records mapping features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend files for documentation or planning.",
  "frontend/index.css": "Defines Tailwind base styles and OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Basic HTML entry point loading the React application root.",
  "frontend/src/App.tsx": "Top-level React app wiring providers and rendering all main sections and components.",
  "frontend/src/components/account/AccountSheet.tsx": "Account panel with tabs for profile, orders, and subscriptions plus logout support.",
  "frontend/src/components/account/ActiveSubscriptionsList.tsx": "Displays the user's active subscriptions with loading and empty states.",
  "frontend/src/components/account/OrderHistoryList.tsx": "Shows the user's order history with formatted timestamps and fallback UI.",
  "frontend/src/components/account/ProfileCompletionDialog.tsx": "Dialog prompting users to complete and save their profile before checkout.",
  "frontend/src/components/account/ProfileForm.tsx": "Form component for editing and saving a user's profile with fields for name, email, phone, and address.",
  "frontend/src/components/auth/LoginDialog.tsx": "Dialog that triggers Internet Identity login and closes on success.",
  "frontend/src/components/auth/LoginRequiredDialog.tsx": "Dialog prompting login before restricted actions, offering login and cancel options.",
  "frontend/src/components/cart/CartSheet.tsx": "Slide-out cart panel showing items, allowing quantity changes, and handling checkout with auth and profile checks.",
  "frontend/src/components/layout/Footer.tsx": "Footer with contact details, branding, and a dynamic copyright note.",
  "frontend/src/components/layout/Header.tsx": "Top navigation bar with menu, cart, login/account buttons, and supporting mobile sheets.",
  "frontend/src/components/navigation/MobileMenuSheet.tsx": "Mobile side menu listing navigation links that close on selection and smooth-scroll to sections.",
  "frontend/src/components/products/ProductCard.tsx": "Product display card with image, price, and an auth-gated add-to-cart action.",
  "frontend/src/components/sections/CategorySection.tsx": "Category grid linking to shop sections with smooth scrolling on click.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero banner with background image, tagline, and a button that scrolls to categories.",
  "frontend/src/components/sections/ReadyToCutSection.tsx": "Section listing ready-to-cut products using ProductCard components.",
  "frontend/src/components/sections/SaladSection.tsx": "Renders a salad product card from the salads list and adds it to the cart with authentication gating.",
  "frontend/src/components/sections/SubscriptionSection.tsx": "Displays subscription plans with options to add to cart or subscribe via WhatsApp, requiring authentication.",
  "frontend/src/components/sections/VegetableSection.tsx": "Shows a grid of vegetable products using ProductCard and includes a price disclaimer.",
  "frontend/src/components/whatsapp/WhatsAppFloatingButton.tsx": "Provides a floating WhatsApp chat button linking to a preset number.",
  "frontend/src/data/products.ts": "Defines Product interface and exports a list of vegetable product entries with pricing and images.",
  "frontend/src/data/subscriptions.ts": "Defines SubscriptionPlan and exports three fixed subscription plan configurations.",
  "frontend/src/features/auth/AuthGateProvider.tsx": "Implements an auth gate context that prompts login and runs deferred actions after authentication.",
  "frontend/src/features/auth/sessionCache.ts": "Clears user-related React Query caches including profile, orders, and subscriptions.",
  "frontend/src/features/auth/useAuthGate.ts": "Provides access to the AuthGateContext and ensures usage within its provider.",
  "frontend/src/features/cart/CartProvider.tsx": "Maintains cart state with add, remove, update, and persistence via localStorage.",
  "frontend/src/features/cart/cartStorage.ts": "Loads and saves cart items to localStorage with error handling.",
  "frontend/src/features/cart/cartTypes.ts": "Defines CartItem and CartState interfaces used by the cart system.",
  "frontend/src/features/cart/useCart.ts": "Returns the cart context and enforces provider usage.",
  "frontend/src/features/orders/orderMutations.ts": "Defines mutations for adding orders and subscriptions and invalidates related queries.",
  "frontend/src/features/orders/orderQueries.ts": "Provides queries for order history and active subscriptions using the actor backend.",
  "frontend/src/features/profile/profileQueries.ts": "Implements profile fetch and update mutations, invalidating the profile cache on change.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hooks for managing Internet Identity authentication using AuthClient, including login, logout, and identity persistence.",
  "frontend/src/index.css": "Defines Tailwind base styles and theme variables for light/dark modes, including custom colors, shadows, and global typography.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL parameters and session-stored parameters, supporting both query and hash routing.",
  "frontend/src/utils/whatsappCheckout.ts": "Builds a WhatsApp deep-link URL containing formatted customer info, cart items, and total for checkout messaging.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, radii, shadows, and animations, and enabling typography, container queries, and animate plugins.",
  "project_state.json": "Tracks project requirements, features, and architectural notes for building the Fresh Bites 49 grocery storefront."
}