{
  "backend/main.mo": "Motoko backend actor managing user profiles, orders, and subscriptions with access‑controlled CRUD operations and ID counters.",
  "feature_evidence.json": "Feature evidence report listing text‑replacement and navigation‑label update tasks with affected files and components.",
  "frontend-file-summaries.txt": "JSON-like list summarizing key frontend files including sections, components, data, and cart logic.",
  "frontend/index.css": "CSS entry defining Tailwind layers and OKLCH-based theme variables for light and dark modes.",
  "frontend/index.html": "Base HTML shell mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component wiring providers and rendering all major page sections and layout components.",
  "frontend/src/components/account/AccountSheet.tsx": "Account side-sheet with tabs for profile, orders, and subscriptions, plus logout and profile-saving logic.",
  "frontend/src/components/account/ActiveSubscriptionsList.tsx": "Displays user's active subscriptions with loading state and status badges.",
  "frontend/src/components/account/OrderHistoryList.tsx": "Shows user's past orders with loading and empty states and formatted timestamps.",
  "frontend/src/components/account/ProfileCompletionDialog.tsx": "Dialog prompting users to complete and save their profile before checkout.",
  "frontend/src/components/account/ProfileForm.tsx": "Form component that loads initial profile data and submits updated user profile fields.",
  "frontend/src/components/auth/LoginDialog.tsx": "Dialog prompting users to log in via Internet Identity with loading feedback.",
  "frontend/src/components/auth/LoginRequiredDialog.tsx": "Dialog shown when login is required, allowing Internet Identity login or cancellation.",
  "frontend/src/components/cart/CartSheet.tsx": "Slide‑in cart panel enabling item management and checkout, including auth and profile checks.",
  "frontend/src/components/layout/Footer.tsx": "Footer with branding, contact details, and a dynamic year plus external link attribution.",
  "frontend/src/components/layout/Header.tsx": "Site header providing navigation triggers, cart access, and login/account actions.",
  "frontend/src/components/navigation/MobileMenuSheet.tsx": "Mobile slide‑in menu listing navigation anchors and supporting smooth scrolling.",
  "frontend/src/components/products/ProductCard.tsx": "Product display card with image fallback and authenticated add‑to‑cart handling.",
  "frontend/src/components/sections/CategorySection.tsx": "Category grid linking to page sections with smooth scroll behavior.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero banner with background image and CTA button that scrolls to categories.",
  "frontend/src/components/sections/ReadyToCutSection.tsx": "Section rendering Ready‑to‑Cook items using ProductCard components.",
  "frontend/src/components/sections/SaladSection.tsx": "Displays a single salad product with image fallback and allows adding it to the cart via auth-gated action.",
  "frontend/src/components/sections/SubscriptionSection.tsx": "Renders subscription plan cards with add-to-cart and WhatsApp-based subscription actions, gated by authentication.",
  "frontend/src/components/sections/VegetableSection.tsx": "Shows a grid of vegetable ProductCards and a notice about fluctuating market prices.",
  "frontend/src/components/whatsapp/WhatsAppFloatingButton.tsx": "Provides a floating WhatsApp button that opens a predefined chat link.",
  "frontend/src/data/products.ts": "Defines the Product interface and exports an array of vegetable product data.",
  "frontend/src/data/subscriptions.ts": "Defines SubscriptionPlan and provides a list of predefined subscription plans.",
  "frontend/src/features/auth/AuthGateProvider.tsx": "Implements auth-gated action execution with a login-required dialog using Internet Identity.",
  "frontend/src/features/auth/sessionCache.ts": "Clears cached auth‑related queries and resets the QueryClient.",
  "frontend/src/features/auth/useAuthGate.ts": "Hook that exposes the AuthGate context and enforces provider usage.",
  "frontend/src/features/cart/CartProvider.tsx": "Provides cart state with add, remove, quantity update, and persistence via localStorage.",
  "frontend/src/features/cart/cartStorage.ts": "Loads and saves cart items to localStorage with error handling.",
  "frontend/src/features/cart/cartTypes.ts": "Defines CartItem and CartState interfaces for cart structure.",
  "frontend/src/features/cart/useCart.ts": "Hook that returns the cart context and ensures provider usage.",
  "frontend/src/features/orders/orderMutations.ts": "Provides mutations for adding orders and subscriptions and invalidates related queries.",
  "frontend/src/features/orders/orderQueries.ts": "Query hooks for retrieving order history and active subscriptions using the actor API.",
  "frontend/src/features/profile/profileQueries.ts": "Query and mutation hooks for getting and updating user profile and delivery address.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hooks for managing Internet Identity authentication using AuthClient, including login state and stored identities.",
  "frontend/src/index.css": "Defines global Tailwind CSS layers, theme variables, dark mode styles, and custom utility shadows.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and InternetIdentityProvider before rendering App.",
  "frontend/src/utils/unsplashSource.ts": "Exports a static fallback image URL and deprecated helper functions returning the same URL.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, clearing, and persisting URL parameters using query strings, hashes, and sessionStorage.",
  "frontend/src/utils/whatsappCheckout.ts": "Builds a WhatsApp deep-link URL containing a formatted order summary using cart items and user profile data.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, shadows, animations, and enabling typography, container queries, and animate plugins.",
  "project_state.json": "Tracks project metadata, requirements, and the request to replace all 'Ready to Cut' text with 'Ready to Cook' across the site."
}