{
  "kind": "build_request",
  "title": "Global copy update: “Ready to Cut” → “Ready to Cook”",
  "projectName": "Fresh Bites 49",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Replace every user-facing occurrence of the exact text \"Ready to Cut\" with \"Ready to Cook\" across the entire Fresh Bites 49 frontend, including (but not limited to) section headings, product titles, category labels, and navigation/menu labels.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Replace every occurrence of the text: \"Ready to Cut\" With: \"Ready to Cook\" ... This includes: - Section headings - Product titles - Category labels - Any internal references"
        ]
      },
      "acceptanceCriteria": [
        "A repo-wide search for the exact string \"Ready to Cut\" in frontend source files returns zero matches (excluding any historical build artifacts if present).",
        "The category tile label previously shown as \"Ready to Cut\" now displays as \"Ready to Cook\" with identical styling (font, size, color, spacing).",
        "The section heading previously shown as \"Ready to Cut\" now displays as \"Ready to Cook\" with identical styling (font, size, color, spacing).",
        "All products that previously had names starting with \"Ready to Cut\" now display \"Ready to Cook\" in their titles, with no price/priceDisplay changes."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update any internal in-app references that surface this label in navigation/scroll targets so the user sees and navigates using \"Ready to Cook\" consistently (e.g., menu item text and any visible label connected to in-page navigation), while keeping cart behavior and WhatsApp checkout behavior unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Make sure it updates everywhere consistently.",
          "Do NOT change: ... Cart functionality ... WhatsApp checkout system",
          "Keep design, styling and formatting exactly the same. Only update the wording from \"Ready to Cut\" to \"Ready to Cook\"."
        ]
      },
      "acceptanceCriteria": [
        "All navigation/menu entries that previously displayed \"Ready to Cut\" now display \"Ready to Cook\" and still scroll to the correct section.",
        "Cart add/remove/quantity controls continue to work for all products, including the \"Ready to Cook\" products, with no behavior change.",
        "WhatsApp checkout URL generation and message formatting remain unchanged except that product line items reflect the updated product names if they previously contained \"Ready to Cut\"."
      ]
    }
  ],
  "constraints": [
    "Do not change prices or priceDisplay values anywhere.",
    "Do not change any images or image URLs.",
    "Do not change layout, spacing, styling, or formatting; only update the specified wording.",
    "Do not change cart functionality.",
    "Do not change the WhatsApp checkout system (phone number, URL format, or message structure), aside from naturally reflecting the updated product names if applicable."
  ],
  "nonGoals": [
    "Redesigning any section or altering the site theme.",
    "Changing product/category data structures beyond the minimum text substitution required.",
    "Backend changes or migrations."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}