{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fresh Bites 49 – Global copy update: Ready to Cut → Ready to Cook",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Replace all user-facing instances of the exact text \"Ready to Cut\" with \"Ready to Cook\" across the frontend (headings, category labels, product titles, and other visible text).",
      "acceptanceCriteria": [
        "A repo-wide search for the exact string \"Ready to Cut\" in frontend source files returns zero matches (excluding any historical build artifacts if present).",
        "The category tile label previously shown as \"Ready to Cut\" now displays as \"Ready to Cook\" with identical styling (font, size, color, spacing).",
        "The section heading previously shown as \"Ready to Cut\" now displays as \"Ready to Cook\" with identical styling (font, size, color, spacing).",
        "All products that previously had names starting with \"Ready to Cut\" now display \"Ready to Cook\" in their titles, with no price/priceDisplay changes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/ReadyToCutSection.tsx",
          "operation": "modify",
          "description": "Update the section heading text from \"Ready to Cut\" to \"Ready to Cook\" while keeping the section id, layout, and styling unchanged."
        },
        {
          "path": "frontend/src/components/sections/CategorySection.tsx",
          "operation": "modify",
          "description": "Update the category tile display name from \"Ready to Cut\" to \"Ready to Cook\" while keeping the same href/scroll target and all styling unchanged."
        },
        {
          "path": "frontend/src/data/products.ts",
          "operation": "modify",
          "description": "Update ready-to-cut product names that start with \"Ready to Cut\" to instead start with \"Ready to Cook\", without changing any price or priceDisplay values and without changing any image or image URL fields."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Update in-app navigation/scroll-linked visible labels to \"Ready to Cook\" consistently while keeping cart behavior and WhatsApp checkout behavior unchanged.",
      "acceptanceCriteria": [
        "All navigation/menu entries that previously displayed \"Ready to Cut\" now display \"Ready to Cook\" and still scroll to the correct section.",
        "Cart add/remove/quantity controls continue to work for all products, including the \"Ready to Cook\" products, with no behavior change.",
        "WhatsApp checkout URL generation and message formatting remain unchanged except that product line items reflect the updated product names if they previously contained \"Ready to Cut\"."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/navigation/MobileMenuSheet.tsx",
          "operation": "modify",
          "description": "Update the menu item label from \"Ready to Cut\" to \"Ready to Cook\" while keeping the same href (#ready-to-cut) so scrolling behavior remains unchanged."
        },
        {
          "path": "frontend/src/utils/whatsappCheckout.ts",
          "operation": "modify",
          "description": "Confirm WhatsApp checkout URL generation and message structure remain unchanged; no logic changes expected—only ensure it naturally reflects updated product item names coming from cart items."
        },
        {
          "path": "frontend/src/components/cart/CartSheet.tsx",
          "operation": "modify",
          "description": "Confirm cart display and checkout flow remain unchanged and continue using item.name/priceDisplay; no logic changes expected—only ensure updated names render correctly everywhere the cart lists items."
        }
      ]
    }
  ]
}